In [3]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [6]:
data = {
    "id" : [1,2,3,4,5,6,7,8,9,10],
    "MovieName" : ['ABCD','ABCD2','Bahubali','Tiger','Fukrey','Kaabil','Raees','Sultan','Dangal','Tubelight'],
    "Rating" : [4,3,5,3,4,5,4,5,3,2]
}

In [7]:
series = pd.Series(data)

In [8]:
series

MovieName    [ABCD, ABCD2, Bahubali, Tiger, Fukrey, Kaabil,...
Rating                          [4, 3, 5, 3, 4, 5, 4, 5, 3, 2]
id                             [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
dtype: object

In [9]:
df = pd.DataFrame(data)

In [10]:
df

   MovieName  Rating  id
0       ABCD       4   1
1      ABCD2       3   2
2   Bahubali       5   3
3      Tiger       3   4
4     Fukrey       4   5
5     Kaabil       5   6
6      Raees       4   7
7     Sultan       5   8
8     Dangal       3   9
9  Tubelight       2  10

In [12]:
type(series)

pandas.core.series.Series

In [16]:
df[0:5]

  MovieName  Rating  id
0      ABCD       4   1
1     ABCD2       3   2
2  Bahubali       5   3
3     Tiger       3   4
4    Fukrey       4   5

In [17]:
df.head()

  MovieName  Rating  id
0      ABCD       4   1
1     ABCD2       3   2
2  Bahubali       5   3
3     Tiger       3   4
4    Fukrey       4   5

In [18]:
df.MovieName

0         ABCD
1        ABCD2
2     Bahubali
3        Tiger
4       Fukrey
5       Kaabil
6        Raees
7       Sultan
8       Dangal
9    Tubelight
Name: MovieName, dtype: object

In [19]:
df[df['Rating'] >= 4]

  MovieName  Rating  id
0      ABCD       4   1
2  Bahubali       5   3
4    Fukrey       4   5
5    Kaabil       5   6
6     Raees       4   7
7    Sultan       5   8